<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"stacks/sample_bucket","backend":"c24516d0c54c195db9b64c89b0e11cefe53fc4982abd683a087e891c222af98c","plan_job_ref":"Job Terraform #45 at https://github.com/rdhar/terraform-with-comments/actions/runs/5105575632","plan_hash":"292d18bcdfce9059062e6c3188c8756cfd0b3a30accf2955abc66fa25b8fac04","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __stacks/sample_bucket__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sample_bucket.aws_s3_bucket.sample will be created
  + resource "aws_s3_bucket" "sample" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "sample"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "sample-bucket"
        }
      + tags_all                    = {
          + "Name"      = "sample-bucket"
          + "Stack"     = "sample_bucket"
          + "Terraform" = "default"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.sample_bucket.aws_s3_bucket_versioning.sample will be created
  + resource "aws_s3_bucket_versioning" "sample" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sample_bucket_id = (known after apply)
```
</details>

:memo: Plan generated in [Terraform #45](https://github.com/rdhar/terraform-with-comments/actions/runs/5105575632)